docs/notes/emacs/edebug.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debugging Elisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Debugging Elisp</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd4ff206">Steps</a></li>
<li><a href="#org9b7cdb6">Keys</a></li>
<li><a href="#org590e776">Backtrace Buffer</a></li>
</ul>
</div>
</nav>
<p>
To debug elisp programs, use <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Edebug.html">Edebug</a>.
</p>

<div id="outline-container-orgd4ff206" class="outline-2">
<h2 id="orgd4ff206"><a href="#orgd4ff206">Steps</a></h2>
<div class="outline-text-2" id="text-orgd4ff206">
<ol class="org-ol">
<li><p>
Instrument the function to debug (i.e. add debugging symbols). <code>Cu C-M-x</code>
(prefix + <code>eval-defun</code>).
</p>

<p>
Now, any call to the function pauses the interpreter and Edubg at the start
of the function.
</p></li>

<li>Call the function.</li>

<li>Pres <code>SPC</code> to step through forms.</li>
</ol>
</div>
</div>

<div id="outline-container-org9b7cdb6" class="outline-2">
<h2 id="org9b7cdb6"><a href="#org9b7cdb6">Keys</a></h2>
<div class="outline-text-2" id="text-org9b7cdb6">
<ul class="org-ul">
<li><code>b</code> Set a breakpoint</li>
<li><code>g</code> Execute until a breakpoint</li>
<li><code>q</code> Exit</li>
<li><code>?</code> Help</li>
</ul>
</div>
</div>

<div id="outline-container-org590e776" class="outline-2">
<h2 id="org590e776"><a href="#org590e776">Backtrace Buffer</a></h2>
<div class="outline-text-2" id="text-org590e776">
<ul class="org-ul">
<li><code>+/-</code> Expand/contract (over multiple lines) the frame at point</li>
</ul>
</div>
</div>
</div>
</body>
</html>
